tests/integration/cassettes/TestInvoicePayment.test_create.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-11-24T07:03:32",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"currency\": \"EUR\", \"paid_total\": 200, \"invoice_id\": 1273230, \"date\": \"2020-01-02\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "83"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.23.0"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/4TOwUrFMBCF4VeRs05lMpEGsvcFLrpxE0ISYaBNS5gIRfruIlJ1d7c/3wznE1IQ/Ozm2RqUpBUBTEwT2YkYBtI+NskV4Yda9o4dGUipTeVdakfAjYmIPAxUdPn+Uca6Hg/X8WmwJylRN00LAhM90v8UpcWU8zaaxjx6ry0fv+wv4Pn1BoPca9JaYtJrrLUTP72QD+SC4zcYjL3cMedXAAAA///HtyUh/AAAAA==",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "181"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 24 Nov 2020 07:03:32 GMT"
          ],
          "Etag": [
            "W/\"4907f2a282e199e4e611a9009ae359c9\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "12ae9300-3b15-4893-9e21-3d0050fd6a01"
          ],
          "X-Runtime": [
            "0.074556"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}