tests/integration/cassettes/TestInvoicePayment.test_delete.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-02-18T09:17:44",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"paid_total\": 100, \"currency\": \"EUR\", \"invoice_id\": 893702, \"date\": \"2020-01-01\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=10cee7728f7aa84e73f982cdb1e46290"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "82"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "POST",
        "uri": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/payments"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/4TOwWqFMBCF4VcpZx3LJCpq9n0BaTfdhJCkMKBRwqQgxXcvban37u7255vhfIEjbG/avmsVopcEC0OGGtINaShw/tw4JNg/Ok7tQEaBY8rCH5wKLGZDRL9aWJafF7Gu6/H0f3sq7J6jk038AquJnuk+Oc7Oh7DVLC7UUlIOx8VuAS9vMxRCSV5SdF6urabR4ytNVg+2696hUPf4wJzfAQAA//8zXKK1+wAAAA==",
          "encoding": "utf-8"
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "181"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 09:17:44 GMT"
          ],
          "Etag": [
            "W/\"8ba6a376ca86a1789190c940fcf64013\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "2eaa8723-6163-4dfb-b038-85b42bae0095"
          ],
          "X-Runtime": [
            "0.075848"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/payments"
      }
    },
    {
      "recorded_at": "2020-02-18T09:17:44",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=10cee7728f7aa84e73f982cdb1e46290"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "0"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "DELETE",
        "uri": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/payments/523543"
      },
      "response": {
        "body": {
          "base64_string": "",
          "encoding": null
        },
        "headers": {
          "Cache-Control": [
            "no-cache"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Date": [
            "Tue, 18 Feb 2020 09:17:44 GMT"
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "000397c2-8ca9-4595-a0fe-9e7d9f1cde9f"
          ],
          "X-Runtime": [
            "0.056598"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 204,
          "message": "No Content"
        },
        "url": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/payments/523543"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}