tests/integration/cassettes/TestPurchase.test_create_full.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-11-24T07:09:58",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"info\": \"dummy info text\", \"items\": [{\"title\": \"dummy purchase item, first\", \"tax_included\": false, \"total\": 100, \"tax\": 2}, {\"title\": \"dummy purchase item, second\", \"total\": 200, \"tax\": 3.5}], \"custom_properties\": {\"test\": \"vars\"}, \"reference\": \"reference text\", \"date\": \"2020-01-01\", \"service_period_from\": \"2020-01-01\", \"currency\": \"EUR\", \"payment_method\": \"bank_transfer\", \"company_id\": 760895556, \"tags\": [\"dummy file\"], \"service_period_to\": \"2020-12-31\", \"receipt_identifier\": \"7KM35G\", \"due_date\": \"2021-01-01\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "519"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.23.0"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/purchases"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/5RSwY7TMBD9lWrObmUnTdP4jjggLgguoJXl2pOuRWJH9hhtteq/I9M0ZXNZuMWTN2/evDev4CxI0Qne7Bk4i55c7zCChA8VF2LLOa+AQUSDbiL1BtF++lw3H4EBORoQJNg8jpfNlKN51gk3jnBkm97FRBskswMGzvdhAZbHhvCFyo+T9iB9HoYyrMeI3hTK5fsOtJpKveIV33Kx5aLUMqpHXSz1hPGXM6gmjC5Y1ccwrltXEAp3gKi29R8AacoJJEzorfNnYDDpy4ie1Ij0HCxIOGn/U1HUPvUYgYFHUhRIDyCrrt5VewbnGFK6F2te7TgDk2NZ7VLM/vYFGPRuQJXjcDfC5ERhVFMME0ZymEC+XhmQPieQP2YXSxM8MTBhnLS/gLxl2h74sWua5sDA6/GRTsrTNDiMbEOYaAnrTQTXZccy54lBTiXwG3FX14f62Imu6I2JZvbCBsssfTIWrgzKCRSOW2tVH/eH7l/u5a2JgvPiF+mXxdb5/fhSzpshW7Qgez0kXFkuZss14TnEy83IuxfKRLSOlM/jqSzacs75lT1Et/wd0QlN8Haleo7+L9mHXXuYdde7Zq2bYl7Lrm6b/4/scgoRNaFVmpZrFttq/5W3kneyOX4HBnmy72CuvwMAAP//Gx2siR0EAAA=",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "503"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 24 Nov 2020 07:09:58 GMT"
          ],
          "Etag": [
            "W/\"eb43406140ccea3bf95f42c207956493\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "f9da0155-a632-4ffc-a787-3b2164d72c14"
          ],
          "X-Runtime": [
            "0.117614"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/purchases"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}